In [1]:
import pandas as pd
import psycopg2
import sqlalchemy

In [2]:
%load_ext sql

In [3]:
# Format %sql dialect+driver://username:password@host:port/database
%sql postgresql://postgres:password@localhost/postgres

In [4]:
%%sql

Create table If Not Exists stadiumbad(id int, visit_date date,people int);
Truncate table stadiumbad;
insert into stadiumbad (id, visit_date, people) values ('1','2017-01-01',10);
insert into stadiumbad (id, visit_date, people) values ('2','2017-01-02',109);
insert into stadiumbad (id, visit_date, people) values ('3','2017-01-03',150);
insert into stadiumbad (id, visit_date, people) values ('4','2017-01-04',99);
insert into stadiumbad (id, visit_date, people) values ('5','2017-01-05',145);
insert into stadiumbad (id, visit_date, people) values ('6','2017-01-06',99);
insert into stadiumbad (id, visit_date, people) values ('7','2017-01-07',1455);
insert into stadiumbad (id, visit_date, people) values ('8','2017-01-08',99);
insert into stadiumbad (id, visit_date, people) values ('9','2017-01-09',199);
insert into stadiumbad (id, visit_date, people) values ('10','2017-01-10',188);

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql

Create table If Not Exists stadium(id int, visit_date date,people int);
Truncate table stadium;
insert into stadium (id, visit_date, people) values ('1','2017-01-01',10);
insert into stadium (id, visit_date, people) values ('2','2017-01-02',109);
insert into stadium (id, visit_date, people) values ('3','2017-01-03',150);
insert into stadium (id, visit_date, people) values ('4','2017-01-04',99);
insert into stadium (id, visit_date, people) values ('5','2017-01-05',145);
insert into stadium (id, visit_date, people) values ('6','2017-01-06',1455);
insert into stadium (id, visit_date, people) values ('7','2017-01-07',199);
insert into stadium (id, visit_date, people) values ('8','2017-01-08',188);

 * postgresql://postgres:***@localhost/postgres
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%sql select * from stadium

 * postgresql://postgres:***@localhost/postgres
8 rows affected.

[(1, datetime.date(2017, 1, 1), 10),
 (2, datetime.date(2017, 1, 2), 109),
 (3, datetime.date(2017, 1, 3), 150),
 (4, datetime.date(2017, 1, 4), 99),
 (5, datetime.date(2017, 1, 5), 145),
 (6, datetime.date(2017, 1, 6), 1455),
 (7, datetime.date(2017, 1, 7), 199),
 (8, datetime.date(2017, 1, 8), 188)]

In [7]:
%%sql

SELECT id, visit_date, people,
ROW_NUMBER() OVER(ORDER BY id) AS rn
FROM stadium WHERE people >= 100

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(2, datetime.date(2017, 1, 2), 109, 1),
 (3, datetime.date(2017, 1, 3), 150, 2),
 (5, datetime.date(2017, 1, 5), 145, 3),
 (6, datetime.date(2017, 1, 6), 1455, 4),
 (7, datetime.date(2017, 1, 7), 199, 5),
 (8, datetime.date(2017, 1, 8), 188, 6)]

In [8]:
%%sql

SELECT id, visit_date, people,
id - ROW_NUMBER() OVER(ORDER BY id) AS rn
FROM stadium
WHERE people >= 100

 * postgresql://postgres:***@localhost/postgres
6 rows affected.

[(2, datetime.date(2017, 1, 2), 109, 1),
 (3, datetime.date(2017, 1, 3), 150, 1),
 (5, datetime.date(2017, 1, 5), 145, 2),
 (6, datetime.date(2017, 1, 6), 1455, 2),
 (7, datetime.date(2017, 1, 7), 199, 2),
 (8, datetime.date(2017, 1, 8), 188, 2)]

In [9]:
%%sql

WITH base AS (
SELECT id, visit_date, people,
id - ROW_NUMBER() OVER(ORDER BY id) AS rn
FROM stadium
WHERE people >= 100
)

SELECT id, visit_date, people
FROM base
WHERE rn IN (
SELECT rn
FROM base
GROUP BY rn
HAVING COUNT(id) >= 3)

 * postgresql://postgres:***@localhost/postgres
4 rows affected.

[(5, datetime.date(2017, 1, 5), 145),
 (6, datetime.date(2017, 1, 6), 1455),
 (7, datetime.date(2017, 1, 7), 199),
 (8, datetime.date(2017, 1, 8), 188)]